export const questions = [
  {
    number: 1,
    question: "주기적으로 새로운 친구를 만든다.",
  },
  {
    number: 2,
    question: "주기적으로 새로운 친구를 만든다.",
  },
  {
    number: 3,
    question: "주기적으로 새로운 친구를 만든다.",
  },
  {
    number: 4,
    question: "주기적으로 새로운 친구를 만든다.",
  },
  {
    number: 5,
    question: "주기적으로 새로운 친구를 만든다.",
  },
  {
    number: 6,
    question: "주기적으로 새로운 친구를 만든다.",
  },
  {
    number: 7,
    question: "주기적으로 새로운 친구를 만든다.",
  },
  {
    number: 8,
    question: "주기적으로 새로운 친구를 만든다.",
  },
  {
    number: 9,
    question: "주기적으로 새로운 친구를 만든다.",
  },
  {
    number: 10,
    question: "주기적으로 새로운 친구를 만든다.",
  },
];

export const adultQuestions = [
  {
    basic: [
      {
        number: 1,
        question: "주기적으로 새로운 친구를 만든다.",
      },
      {
        number: 2,
        question: "주기적으로 새로운 친구를 만든다.",
      },
      {
        number: 3,
        question: "주기적으로 새로운 친구를 만든다.",
      },
      {
        number: 4,
        question: "주기적으로 새로운 친구를 만든다.",
      },
      {
        number: 5,
        question: "주기적으로 새로운 친구를 만든다.",
      },
    ],
    biss: [
      {
        number: 1,
        situation:
          "친한 친구가 SNS(인스타, 페이스북, 트위터 등등)를 하는 것을 알게되어 팔로우를 신청했습니다. 하지만 며칠이 지나도 팔로우를 받아주지 않습니다. 하지만 알고 보니 다른 사람들과는 모두 팔로워, 팔로잉을 하고 있습니다.",
        options: [
          "팔로우를 왜 받아주지 않냐고 따지거나 화낸다.",
          "팔로우를 받아 줄 때까지 기다린다.",
          "팔로우를 다시 신청한다.",
          "신경쓰지 않는다.",
        ],
      },
      {
        number: 2,
        situation:
          "친한 친구가 SNS(인스타, 페이스북, 트위터 등등)를 하는 것을 알게되어 팔로우를 신청했습니다. 하지만 며칠이 지나도 팔로우를 받아주지 않습니다. 하지만 알고 보니 다른 사람들과는 모두 팔로워, 팔로잉을 하고 있습니다.",
        options: [
          "팔로우를 왜 받아주지 않냐고 따지거나 화낸다.",
          "팔로우를 받아 줄 때까지 기다린다.",
          "팔로우를 다시 신청한다.",
          "신경쓰지 않는다.",
        ],
      },
      {
        number: 3,
        situation:
          "친한 친구가 SNS(인스타, 페이스북, 트위터 등등)를 하는 것을 알게되어 팔로우를 신청했습니다. 하지만 며칠이 지나도 팔로우를 받아주지 않습니다. 하지만 알고 보니 다른 사람들과는 모두 팔로워, 팔로잉을 하고 있습니다.",
        options: [
          "팔로우를 왜 받아주지 않냐고 따지거나 화낸다.",
          "팔로우를 받아 줄 때까지 기다린다.",
          "팔로우를 다시 신청한다.",
          "신경쓰지 않는다.",
        ],
      },
      {
        number: 4,
        situation:
          "친한 친구가 SNS(인스타, 페이스북, 트위터 등등)를 하는 것을 알게되어 팔로우를 신청했습니다. 하지만 며칠이 지나도 팔로우를 받아주지 않습니다. 하지만 알고 보니 다른 사람들과는 모두 팔로워, 팔로잉을 하고 있습니다.",
        options: [
          "팔로우를 왜 받아주지 않냐고 따지거나 화낸다.",
          "팔로우를 받아 줄 때까지 기다린다.",
          "팔로우를 다시 신청한다.",
          "신경쓰지 않는다.",
        ],
      },
      {
        number: 5,
        situation:
          "친한 친구가 SNS(인스타, 페이스북, 트위터 등등)를 하는 것을 알게되어 팔로우를 신청했습니다. 하지만 며칠이 지나도 팔로우를 받아주지 않습니다. 하지만 알고 보니 다른 사람들과는 모두 팔로워, 팔로잉을 하고 있습니다.",
        options: [
          "팔로우를 왜 받아주지 않냐고 따지거나 화낸다.",
          "팔로우를 받아 줄 때까지 기다린다.",
          "팔로우를 다시 신청한다.",
          "신경쓰지 않는다.",
        ],
      },
    ],
  },
];

export const options = [
  {
    value: 1,
    id: "I_strongly_disagree",
    title: "매우 그렇지 않다",
  },
  {
    value: 2,
    id: "I_disagree",
    title: "그렇지 않다",
  },
  {
    value: 3,
    id: "I_am_not_sure",
    title: "보통이다",
  },
  {
    value: 4,
    id: "I_agree",
    title: "그렇다",
  },
  {
    value: 5,
    id: "I_strongly_agree",
    title: "매우 그렇다",
  },
];
